#!/bin/bash
# Первой строкой пишем имя интерпретатора, предваряя символами #!

# Следующий код создаст переменные TO_ARCHIVE и TO_DELETE
# Их значениями будет результат выполнения команды.
# Чтобы этого добиться мы использовали косые одинарные кавычки.
TO_ARCHIVE=`date --date="-2days" +%Y_%m_%d`
TO_DELETE=`date --date="-10days" +%Y_%m_%d`

# В bash-скрипте просто пишутся команды которые нужно выполнить.
# Для использования значения переменной нужно написать её имя после $.
# Мы использовали || true чтобы проигнорировать ошибку, если файла нет.
gzip /var/log/sample_log_$TO_ARCHIVE.log || true
rm /var/log/sample_log_$TO_DELETE.log.gz || true